app/views/documents/index.html.erb

INSERT INTO "documents" ("nombre", "created_at", "updated_at", "descripcion") VALUES (?, ?, ?, ?)  [["nombre", "qdfghjk"], ["created_at", "2018-12-10 04:11:03.731035"], ["updated_at", "2018-12-10 04:11:03.731035"], ["descripcion", "qwertyuiolkjhgf"]]
---
					<h4 class='card-title'><%= document.nombre %></h4>
					<p class='card-text'><%= document.created_at %></p>

UPDATE "documents" SET "updated_at" = ? WHERE "documents"."id" = ?  [["updated_at", "2018-12-10 04:11:03.736052"], ["id", 6]]
---

		$(document).ready(function () {
			$('#sidebarCollapse').on('click', function () {
				$('#sidebar').toggleClass('active');
			});
		});