app/views/documents/show.html.erb

</br><br>
<%= link_to_if(@document = current_user.documents.find(@document.id), "Compartir documento", { action: "edit"})%>
---
SELECT  "documents".* FROM "documents" INNER JOIN "documents_users" ON "documents"."id" = "documents_users"."document_id" WHERE "documents_users"."user_id" = ? AND "documents"."id" = ? LIMIT ?  [["user_id", 4], ["id", 11], ["LIMIT", 1]]