app/channels/conversation_channel.rb

INSERT INTO `messages` (`body`, `user_id`, `conversation_id`, `created_at`, `updated_at`) VALUES ('Hola', 4, 1, '2018-12-16 20:34:53', '2018-12-16 20:34:53')
---
  def speak(data)
    message_params = data['message'].each_with_object({}) do |el, hash|
      hash[el.values.first] = el.values.last
    end
    Message.create(message_params)