app/helpers/application_helper.rb

    def document_user(document_id)
        @users = User.where.not(collaborators: Collaborator.find_by(document_id: document_id))
---
SELECT  `collaborators`.* FROM `collaborators` WHERE `collaborators`.`document_id` = 1 LIMIT 1