app/controllers/chats_controller.rb

    def index
    session[:conversations] ||= []

    @users = User.all.where.not(id: current_user)
    @conversations = Conversation.includes(:recipient, :messages).find(session[:conversations])
---
SELECT  `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`conversation_id` = 1