app/controllers/conversations_controller.rb

  def close
    @conversation = Conversation.find(params[:id])
---
SELECT  `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1