app/controllers/documents_controller.rb

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1
---
	def document_user_upload
    	@document = Document.find params[:documentid]