app/controllers/documents_controller.rb

	def index
		@documents = User.find(current_user.id).documents
---
SELECT  `documents`.* FROM `documents` INNER JOIN `collaborators` ON `documents`.`id` = `collaborators`.`document_id` WHERE `collaborators`.`user_id` = 3 AND `documents`.`id` = 18 LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def show
		@document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

	def create
		@document = Document.new(document_params)
		if @document.save
			@document.users << current_user
---
INSERT INTO `documents` (`nombre`, `created_at`, `updated_at`, `descripcion`) VALUES ('Otro documento', '2018-12-15 01:16:29', '2018-12-15 01:16:29', 'Hola')
INSERT INTO `documents` (`nombre`, `created_at`, `updated_at`, `descripcion`, `user_id`) VALUES ('wewd', '2018-12-15 22:16:45', '2018-12-15 22:16:45', 'wae', 3)

	def update
		@document = Document.find(params[:id])
		if @document.update(document_reduce_params)
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "documents" SET "descripcion" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["descripcion", "Alejandro"], ["updated_at", "2018-12-11 22:31:53.253282"], ["id", 11]]