app/models/conversation.rb

SELECT  `conversations`.* FROM `conversations` WHERE (`conversations`.`sender_id` = 4 AND `conversations`.`recipient_id` = 3 OR `conversations`.`sender_id` = 3 AND `conversations`.`recipient_id` = 4) ORDER BY `conversations`.`id` ASC LIMIT 1
SELECT  `conversations`.* FROM `conversations` WHERE (`conversations`.`sender_id` = 3 AND `conversations`.`recipient_id` = 4 OR `conversations`.`sender_id` = 4 AND `conversations`.`recipient_id` = 3) ORDER BY `conversations`.`id` ASC LIMIT 1
SELECT  1 AS one FROM `conversations` WHERE `conversations`.`sender_id` = 4 AND `conversations`.`recipient_id` = 3 LIMIT 1
---
  def self.get(sender_id, recipient_id)
    conversation = between(sender_id, recipient_id).first
    return conversation if conversation.present?