app/models/document.rb

INSERT INTO `collaborators` (`document_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 3, '2018-12-16 03:34:30', '2018-12-16 03:34:30')
---
	def save_user
    	begin
    	@users.each do |user_id|
      		Collaborator.create(user_id: user_id, document_id: self.id)